zsh
ripgrep
fd-find
git-delta
fzf
tmux
bat
jq
urlscan
zoxide
eza
watch
lnav
httpie
gh
kubectx
yt-dlp
gnupg
poppler-utils
pandoc
ffmpeg
figlet
libpq-dev
imagemagick
p7zip
luarocks
markdownlint
eslint
graphviz
pipx
luajit
libmagickwand-dev
