# Layout
cask "qwerty-fr"

# Install ghostty 
cask "ghostty"

# Install neovim
brew "neovim"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Cli tools
brew "coreutils"
brew "atuin"
brew "ripgrep"
brew "lazygit"
brew "fd"
brew "git-delta"
brew "fzf"
brew "tmux"
brew "bat"
brew "fpp"
brew "jq"
brew "urlscan"
brew "zoxide"
brew "tlrc"
brew "fx"
brew "yazi"
brew "k9s"
brew "lazydocker"
brew "eza"
brew "progress"
brew "watch"
brew "croc"
brew "lnav"
brew "commitizen"
brew "rga"
brew "httpie"
brew "glow"
brew "tokei"
brew "bottom"
brew "tmux-xpanes"
brew "spacer"
brew "gh"
brew "kubectx"
brew "yt-dlp"
brew "typst"
brew "pngpaste"

# Docker
brew "docker"
brew "docker-buildx"
brew "docker-credential-helper"
brew "docker-compose"
brew "colima"

# Apps
brew "wireguard-tools"
cask "spotify"
brew "spotify_player"
cask "karabiner-elements"
cask "localsend"
cask "raycast"
cask "bettertouchtool"
cask "iina"
cask "dbeaver-community"
cask "alt-tab"
cask "hammerspoon"
cask "displaylink"
cask "sf-symbols"
brew "gifski"
cask "proxyman"
cask "jordanbaird-ice"
cask "stats"
cask "aldente"
cask "dropshelf"
cask "cleanshot"
cask "grandperspective"
cask "appcleaner"
cask "orion"
cask "netnewswire"
cask "openmtp"

# Languages
brew "asdf"
brew "pipx"
brew "pnpm"
brew "rustup"
cask "dotnet-sdk"

# Other
brew "antidote"
brew "gnupg"
brew "poppler"
brew "pandoc"
brew "ffmpeg"
brew "figlet"
brew "libpq"
brew "imagemagick"
brew "p7zip"
brew "swiftlint"
brew "periphery"
brew "uv"
brew "graphviz"
brew "pam-reattach"

# Neovim dependencies
brew "luarocks"
brew "ast-grep"
brew "markdown-toc"
brew "markdownlint-cli2"
brew "sqlfluff"
brew "gofumpt"
brew "isort"
brew "php-cs-fixer"
brew "terraform"
brew "eslint_d"
brew "prettier"
brew "xmlformat"
brew "harper"

# Weather
tap "timharek/tap"
brew "yr"
