# Install ghostty 
cask "ghostty"

# Install neovim
brew "neovim"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Cli tools 
brew "ripgrep"
brew "lazygit"
brew "fd"
brew "git-delta"
brew "fzf"
brew "tmux"
brew "bat"
brew "fpp"
brew "jq"
brew "urlscan"
brew "zoxide"
brew "tlrc"
brew "fx"
brew "yazi"
brew "k9s"
brew "lazydocker"
brew "eza"
brew "progress"
brew "watch"
brew "croc"
brew "lnav"
brew "vale"
brew "commitizen"
brew "rga"
brew "httpie"
brew "glow"
brew "tokei"
brew "bottom"
brew "tmux-xpanes"
brew "spacer"
brew "gh"
brew "kubectx"

# Apps
cask "orion"
cask "spotify"
brew "spotify_player"
cask "karabiner-elements"
cask "localsend"
cask "raycast"
cask "bettertouchtool"
cask "iina"
cask "dbeaver-community"
cask "alt-tab"
cask "bitwarden"
brew "bitwarden-cli"
cask "hammerspoon"
cask "displaylink"
cask "sf-symbols"
brew "gifski"
cask "proxyman"
cask "shortcat"
cask "jordanbaird-ice"

# Languages
brew "asdf"
brew "pipx"

# Other
brew "antidote"
brew "gnupg"
brew "poppler"
brew "pandoc"
brew "ffmpeg"
brew "figlet"
brew "libpq"
brew "imagemagick"
brew "p7zip"
brew "swiftlint"
brew "periphery"
brew "uv"

# Neovim dependencies
brew "luarocks"
brew "ast-grep"
brew "markdown-toc"
brew "markdownlint-cli2"
brew "sqlfluff"
brew "gofumpt"
brew "isort"
brew "php-cs-fixer"
brew "terraform"
brew "eslint_d"
brew "xmlformat"
