# Layout
cask "qwerty-fr"

# Install ghostty 
cask "ghostty"

# Install neovim
brew "neovim"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Cli tools
brew "stow"
brew "coreutils"
brew "atuin"
brew "ripgrep"
brew "lazygit"
brew "fd"
brew "git-delta"
brew "fzf"
brew "tmux"
brew "bat"
brew "fpp"
brew "jq"
brew "zoxide"
brew "tlrc"
brew "fx"
brew "yazi"
brew "k9s"
brew "lazydocker"
brew "eza"
brew "watch"
brew "lnav"
brew "commitizen"
brew "rga"
brew "httpie"
brew "glow"
brew "tokei"
brew "bottom"
brew "tmux-xpanes"
brew "gh"
brew "kubectx"
brew "yt-dlp"
brew "typst"
brew "git-secret"

# Apps
cask "docker-desktop"
cask "google-chrome"
cask "postman"
tap "FelixKratz/formulae"
brew "FelixKratz/formulae/borders"
cask "nikitabobko/tap/aerospace"
cask "spotify"
cask "karabiner-elements"
cask "localsend"
cask "raycast"
cask "bettertouchtool"
cask "iina"
cask "datagrip"
cask "alt-tab"
cask "hammerspoon"
cask "displaylink"
brew "gifski"
cask "proxyman"
cask "aldente"
cask "cleanshot"
cask "grandperspective"
cask "openmtp"
cask "shortcat"
cask "claude"
cask "obsidian"

# Languages
brew "pipx"
brew "pnpm"
brew "rustup"
brew "golang"
brew "uv"
brew "fnm"
brew "node"
brew "rbenv"

# Other
brew "antidote"
brew "gnupg"
brew "poppler"
brew "pandoc"
brew "ffmpeg"
brew "libpq"
brew "imagemagick"
brew "p7zip"
brew "graphviz"
brew "pam-reattach"

# Neovim dependencies
brew "luarocks"
brew "ast-grep"
brew "markdown-toc"
brew "markdownlint-cli2"
brew "sqlfluff"
brew "gofumpt"
brew "isort"
brew "php-cs-fixer"
brew "terraform"
brew "eslint_d"
brew "prettier"
brew "harper"
