brew "neovim"
brew "k9s"
brew "glow"
brew "tokei"
brew "bottom"
brew "typst"
brew "markdown-toc"
brew "terraform"
brew "prettier"
brew "tlrc"
brew "fx"
brew "yazi"
brew "lazydocker"
brew "progress"
brew "croc"
brew "rga"
brew "tmux-xpanes"
brew "spacer"
brew "uv"
brew "ast-grep"
brew "sqlfluff"
brew "gofumpt"
brew "isort"
brew "php-cs-fixer"
brew "harper"
brew "atuin"
brew "lazygit"
brew "git-delta"
brew "asdf"
brew "antidote"
brew "commitizen"
brew "rustup"
